from app import data_base


products = {
    'McDonald’s': [
        ['Біг Мак', 70, 10,
         "Два біфштекси з натуральної яловичини, цибуля, маринований огірок, сир “Чеддер”, свіжий салат,"
         " заправлені спеціальним соусом, у булочці з насінням сезаму.",
         1, 'Mac/big_mak'],
        ['Біг Тейсті', 80, 10,
         'Натуральна яловичина у поєднанні зі свіжими овочами та плавленим сиром “Емменталь”.',
         1, 'Mac/big_teisty'],
        ['Дабл Чізбургер', 50, 10,
         'Два біфштекси з натуральної яловичини, два шматочки сиру “Чеддер”, цибуля, гірчиця, кетчуп, булочка.',
         1, 'Mac/dabl_cheese'],
        ['Картопля Фрі', 40, 10,
         'Добірна картопля, засмажена в натуральній олії і трохи підсолена.',
         1, 'Mac/fri'],
        ['Картопляні Діпи', 80, 10,
         'Натуральна яловичина у поєднанні зі свіжими овочами та плавленим сиром “Емменталь”.',
         1, 'Mac/dipu'],
        ['Кока-Кола', 25, 10,
         'Всесвітньо відомий освіжаючий напій.',
         1, 'Mac/cola']
    ],
    'KFC': [
        ['Бакет Дует Оригінальний', 245, 10,
         '2 ніжки гострих, 4 гострих крильця , 4 стріпси гострих та картопля фрі середня.',
         2, 'KFC/BUCKET DUET ORIGINAL'],
        ['Бакет Фрі', 75, 10,
         'Бакет Фрі 200 гр.',
         2, 'KFC/BUCKET FRIES'],
        ['Чізбургер', 50, 10,
         'Пряний гірч. соус, кетчуп, стріпси оригінальні,'
         ' сир Чеддер, огірки на пшеничній булочці з кукурудзяною посипкою.',
         2, 'KFC/CHEESEBURGER'],
        ['Чікенбургер', 75, 10,
         'Соус «Гамбургер», філе в оригінальній паніровці, мариновані огірки'
         ' на пшеничній булочці з чорно-білим кунжутом.',
         2, 'KFC/CHICKENBURGER'],
        ['Картопля по-селянськи', 50, 10,
         'Розсипчаста і хрустка картопля по-селянськи - улюблений смак тепер в KFC! 135 гр.',
         2, 'KFC/HOMEMADE POTATOES'],
        ['Пепсі Макс 0.5 л', 35, 10,
         'Пепсі Макс 0.5 л',
         2, 'KFC/PEPSI MAX']
    ]
}

db = data_base.DataBase()

for shop in products:
    db.add_company(shop)
    for product in products[shop]:
        product_name = product[0]
        print(product[5])
        db.add_product(product[0], product[1], product[2], product[3], product[4], product[5])
